blog/2017/06/14/adding-keymaps-to-src-blocks-via-org-font-lock-hook/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>Adding-keymaps-to-src-blocks-via-org-font-lock-hook - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="raw" />
  <!-- <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css"/>
       <link rel="stylesheet" href="../../../../../media/css/comment.css" type="text/css"/> -->
  <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/kognise/water.css@latest/dist/dark.css'>
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;随便,谢谢</p>
    <nav class="site-nav">
      <ul class="trigger">
        <li><a href="../../../../../years/">Years</a></li>
        <li><a href="../../../../../authors/">Authors</a></li>
        <li><a href="../../../../../tags/">Tags</a></li>
        <li><a href="../../../../../about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document.git">Github</a></li>
        <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="https://www.bing.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">Adding-keymaps-to-src-blocks-via-org-font-lock-hook</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org163dd44">Update</a></li>
<li><a href="#orge79483e">Update #2</a></li>
</ul>
</div>
</div>
<p>
I had an idea to use custom keymaps in src-blocks. For example, you could then
我有一个在src块中使用自定义键映射的想法。例如，你可以
use lispy directly in your org-files without entering org-special-edit, or the
直接在组织文件中使用lispy，而不需要输入org-special-edit或
elpy key-bindings in python blocks. There are other solutions I have seen,
python块中的elpy键绑定。我还看到了其他的解决方案，
e.g. polymode, that claim to do this. You might guess that if they worked, I
例如polymode，声称要这样做。你可能会猜，如果他们工作，我
would not be writing this! There was some nice discussion about this idea on
就不会写这些了!关于这个想法有一些很好的讨论
the org-mode mailing list, and Nicolas Goaziou pointed out this might be
组织模式邮件列表，Nicolas Goaziou指出这可能是
accomplished with the org-font-lock-hook.
使用org-font-lock-hook完成。
</p>

<p>
You can check out the video here:
你可以在这里观看视频:
</p>

<p>
<a href="https://www.youtube.com/embed/a2jHqB1qWiY">https://www.youtube.com/embed/a2jHqB1qWiY</a>
<a href="https://www.youtube.com/embed/a2jHqB1qWiY">https://www.youtube.com/embed/a2jHqB1qWiY</a>
</p>

<p>
It was relatively easy to figure out how to do this. Keymaps can be added to
解决这个问题相对容易。可以将键映射添加到
regions during font-lock, so I just had to hook into the org-mode font lock
区域在字体锁定，所以我只是钩到组织模式字体锁定
system with a function to find the src blocks and add the keymap as a
系统具有查找src块并添加keymap的功能
text-property. That took three steps:
文本属性。这需要三个步骤:
</p>

<ol class="org-ol">
<li>Define the keymaps to use. I use an a-list of (language . map) for this.</li>
<li>定义要使用的键映射。我用的是第一流的语言。地图)。</li>
<li>Define the font-lock function. This will add the keymap properties to</li>
<li>定义字体锁定函数。这将向其中添加keymap属性</li>
</ol>
<p>
src-blocks.
src-blocks。
</p>
<ol class="org-ol">
<li>Define a minor mode to toggle this feature on and off.</li>
</ol>
<p>
3.定义一个次要模式来打开和关闭此功能。
</p>

<p>
Here is the definition of the keymaps. Generally I just copy the mode-map I
下面是键映射的定义。通常我只是复制模式映射I
want and then add some things to them. For example sometimes it is still a
想要，然后添加一些东西到他们。例如，有时它仍然是
good idea to jump into the org-special-edit mode. For example, if you try to
跳进组织-特别编辑模式是个好主意。例如，如果你尝试
use a command in a Python block to send the buffer to the repl while in
使用Python块中的命令将缓冲区发送到repl
org-mode you are sure to get an error! You might also want to add the C-c C-e
组织模式你一定会得到一个错误!你也可以加上C-c - C-e
export command if you use that a lot. An alternative approach, of course, is
导出命令，如果您经常使用它。当然，另一种方法是
to copy the org-map and add additional bindings to it. The choice is up to
复制组织映射并向其添加附加绑定。选择权在你
you.
你。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"># + BEGIN_SRC emacs lisp
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">lispy</span>)
(&#38656;&#35201;&#30340;lispy)
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">elpy</span>)
(&#38656;&#35201;&#30340;elpy)

(<span style="font-weight: bold;">setq</span> scimax-src-block-keymaps
(<span style="font-weight: bold;">setq</span> scimax-src-block-keymaps
`((<span style="font-style: italic;">"ipython"</span> . ,(<span style="font-weight: bold;">let</span> ((map (make-composed-keymap
&#8221;(&#8220;ipython&#8221;&#12290;,((((make-composed-keymap&#22320;&#22270;
`(,elpy-mode-map ,python-mode-map ,pyvenv-mode-map)
&#8220;&#28857;&#38453;&#20934;&#22791;&#8221;
org-mode-map)))
org-mode-map)))
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">In org-mode I define RET so we f</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">&#22312;&#32452;&#32455;&#27169;&#24335;&#20013;&#65292;&#25105;&#23450;&#20041;RET&#65292;&#25152;&#20197;&#25105;&#20204;f</span>
(define-key map (kbd <span style="font-style: italic;">"&lt;return&gt;"</span>) 'newline)
(&#23450;&#20041;&#38190;&#26144;&#23556;(kbd&#8220;&lt;return&gt;&#8221;)&#8220;&#25442;&#34892;&#31526;)
(define-key map (kbd <span style="font-style: italic;">"C-c C-c"</span>) 'org-ctrl-c-ctrl-c)
(&#23450;&#20041;&#38190;&#26144;&#23556;(kbd&#8220;C-c -c&#8221;)&#8220;org-ctrl-c-ctrl-c)
map))
&#22320;&#22270;))
(<span style="font-style: italic;">"python"</span> . ,(<span style="font-weight: bold;">let</span> ((map (make-composed-keymap
(&#8220;python&#8221;&#12290;,((((make-composed-keymap&#22320;&#22270;
`(,elpy-mode-map ,python-mode-map ,pyvenv-mode-map)
&#8220;&#28857;&#38453;&#20934;&#22791;&#8221;
org-mode-map)))
org-mode-map)))
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">In org-mode I define RET so we f</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">&#22312;&#32452;&#32455;&#27169;&#24335;&#20013;&#65292;&#25105;&#23450;&#20041;RET&#65292;&#25152;&#20197;&#25105;&#20204;f</span>
(define-key map (kbd <span style="font-style: italic;">"&lt;return&gt;"</span>) 'newline)
(&#23450;&#20041;&#38190;&#26144;&#23556;(kbd&#8220;&lt;return&gt;&#8221;)&#8220;&#25442;&#34892;&#31526;)
(define-key map (kbd <span style="font-style: italic;">"C-c C-c"</span>) 'org-ctrl-c-ctrl-c)
(&#23450;&#20041;&#38190;&#26144;&#23556;(kbd&#8220;C-c -c&#8221;)&#8220;org-ctrl-c-ctrl-c)
map))
&#22320;&#22270;))
(<span style="font-style: italic;">"emacs-lisp"</span> . ,(<span style="font-weight: bold;">let</span> ((map (make-composed-keymap `(,lispy-mode-map
(&#8220;emacs lisp&#8221;&#12290;&#65292;(<span style="font-weight: bold;">let</span> ((map (make- composite -keymap '))&#65292;lispy-mode-map
,emacs-lisp-mode-map
,emacs-lisp-mode-map
,outline-minor-mode-map)
outline-minor-mode-map)
org-mode-map)))
org-mode-map)))
(define-key map (kbd <span style="font-style: italic;">"C-c C-c"</span>) 'org-ctrl-c-ctrl-c)
(&#23450;&#20041;&#38190;&#26144;&#23556;(kbd&#8220;C-c -c&#8221;)&#8220;org-ctrl-c-ctrl-c)
map))))
&#22320;&#22270;))))
</pre>
</div>

<p>
Next we define the function that will apply the keymap to each src block. The
接下来，我们定义将密钥映射应用到每个src块的函数。的
keymaps are only applied when they are defined in the variable above. This
只有在上面的变量中定义了键映射时，才会应用它们。这
function is derived from org-fontify-meta-lines-and-blocks-1.
函数源自org-fontify-meta-line -and-blocks-1。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"># + BEGIN_SRC emacs lisp
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">scimax-add-keymap-to-src-blocks</span> (limit)
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">scimax-add-keymap-to-src-blocks</span>(&#38480;&#21046;)
<span style="font-style: italic;">"Add keymaps to src-blocks defined in `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">scimax-src-block-keymaps</span><span style="font-style: italic;">'."</span>
&#8220;&#23558;&#23494;&#38053;&#26144;&#23556;&#28155;&#21152;&#21040;&#8216;<span style="font-weight: bold; text-decoration: underline;">scimax-src-block-keymaps</span>&#8217;&#20013;&#23450;&#20041;&#30340;src&#22359;&#12290;&#8221;
(<span style="font-weight: bold;">let</span> ((case-fold-search t)
(&#35753;((case-fold-search t)
lang)
&#38271;)
(<span style="font-weight: bold;">while</span> (re-search-forward org-babel-src-block-regexp limit t)
(&#21516;&#26102;(&#37325;&#26032;&#25628;&#32034;-babel-src-block-regexp limit t)
(<span style="font-weight: bold;">let</span> ((lang (match-string 2))
((lang (match-string 2))
(beg (match-beginning 0))
(&#27714;(match-beginning 0))
(end (match-end 0)))
(&#32467;&#26463;(match-end 0)))
(<span style="font-weight: bold;">if</span> (assoc (org-no-properties lang) scimax-src-block-keymaps)
(assoc (org-no-properties lang) scimax-src-block-keymaps)
(<span style="font-weight: bold;">progn</span>
(<span style="font-weight: bold;">progn</span>
(add-text-properties
(add-text-properties
beg end `(local-map ,(cdr (assoc
&#35831;&#27714;&#32467;&#26463;'(&#22320;&#26041;&#22320;&#22270;&#65292;)
(org-no-properties lang)
(org-no-properties&#26391;)
scimax-src-block-keymaps))))
scimax-src-block-keymaps))))
(add-text-properties
(add-text-properties
beg end `(cursor-sensor-functions
&#35831;&#27714;&#32467;&#26463;&#8221;(cursor-sensor-functions
((<span style="font-weight: bold;">lambda</span> (win prev-pos sym)
(<span style="font-weight: bold;">lambda</span> (win prep -pos sym))
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This simulates a mouse click and makes a menu change</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">&#36825;&#23558;&#27169;&#25311;&#40736;&#26631;&#21333;&#20987;&#24182;&#26356;&#25913;&#33756;&#21333;</span>
(org-mouse-down-mouse nil)))))))))))
(org-mouse-down-mouse nil)))))))))))
</pre>
</div>

<p>
Here we create an advice to trick any functions that need to know the major
这里我们创建了一个建议来欺骗任何需要知道专业的函数
mode. We only apply the spoof if we are in org-mode and in a src block though.
模式。我们只在组织模式和src块中应用欺骗。
Otherwise we call the original function. So far lispy–eval is the only
否则我们调用原始函数。到目前为止，lispy-eval是唯一的
function I have needed it for. This might be a general strategy though to do
功能我需要它。这可能是一个通用的策略
other things like narrow to the src-block, or even go into special edit mode
其他的比如缩小到src块，甚至进入特殊的编辑模式
temporarily if there are commands that require it.
暂时的，如果有命令需要它。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"># + BEGIN_SRC emacs lisp
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">scimax-spoof-mode</span> (orig-func <span style="font-weight: bold; text-decoration: underline;">&amp;rest</span> args)
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">scimax-spoof&#27169;&#24335;</span>)
<span style="font-style: italic;">"Advice function to spoof commands in org-mode src blocks.</span>
<span style="font-style: italic;">&#36890;&#30693;&#21151;&#33021;&#65292;&#20197;&#27450;&#39575;&#21629;&#20196;&#22312;&#32452;&#32455;&#27169;&#24335;src&#22359;&#12290;</span>
<span style="font-style: italic;">It is for commands that depend on the major mode. One example is</span>
<span style="font-style: italic;">&#23427;&#36866;&#29992;&#20110;&#20381;&#36182;&#20110;&#20027;&#27169;&#24335;&#30340;&#21629;&#20196;&#12290;&#19968;&#20010;&#20363;&#23376;&#26159;</span>
<span style="font-style: italic;">`</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">lispy--eval</span><span style="font-style: italic;">'."</span>
&#8220;lispy&#8212;&#8212;eval&#8217;&#12290;&#8221;
(<span style="font-weight: bold;">if</span> (org-in-src-block-p)
(&#22914;&#26524;(org-in-src-block-p)
(<span style="font-weight: bold;">let</span> ((major-mode (intern (format <span style="font-style: italic;">"%s-mode"</span> (first (org-babel-get-src-block-info))))))
(<span style="font-weight: bold;">let</span>((&#20027;&#27169;&#24335;)(&#23454;&#20064;&#29983;(&#26684;&#24335;&#21270;<span style="font-style: italic;">"%s&#27169;&#24335;"</span> (first (org-babel-get-src-block-info)))
(apply orig-func args))
(&#24212;&#29992;orig-func args))
(apply orig-func args)))
(&#24212;&#29992;orig-func args)))
</pre>
</div>

<p>
We define a minor mode so we can toggle this on and off. Here we add the
我们定义了一个次要模式，这样我们就可以切换它的开启和关闭
function to the org-font-lock-hook and advise the lispy–eval function. I had
函数，并通知lispy-eval函数。我有
to add the font-lock-function to the end of the org-font-lock hook for some
在某些情况下，可以在org-font-lock钩子的末尾添加font-lock函数
reason, and also add local-map as an extra-managed property so it would be
原因，并将local-map添加为一个额外管理的属性
removed when we toggle it off.
当我们把它关掉时，它就消失了。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"># + BEGIN_SRC emacs lisp
(<span style="font-weight: bold;">define-minor-mode</span> <span style="font-weight: bold;">scimax-src-keymap-mode</span>
(<span style="font-weight: bold;">define-minor-mode</span> <span style="font-weight: bold;">scimax-src-keymap-mode</span>
<span style="font-style: italic;">"Minor mode to add mode keymaps to src-blocks."</span>
&#27425;&#35201;&#27169;&#24335;&#28155;&#21152;&#27169;&#24335;&#38190;&#26144;&#23556;&#21040;src&#22359;&#12290;
<span style="font-weight: bold;">:init-value</span> nil
<span style="font-weight: bold;">:init-value&#23612;&#32599;&#27827;</span>
(<span style="font-weight: bold;">if</span> scimax-src-keymap-mode
(&#22914;&#26524;scimax-src-keymap-mode
(<span style="font-weight: bold;">progn</span>
(<span style="font-weight: bold;">progn</span>
(add-hook 'org-font-lock-hook #'scimax-add-keymap-to-src-blocks t)
(add-hook 'org-font-lock-hook #'scimax-add-keymap-to-src blocks t)
(add-to-list 'font-lock-extra-managed-props 'local-map)
(&#22686;&#21152;&#21040;&#21015;&#34920;font-lock-extra-managed-props local map)
(add-to-list 'font-lock-extra-managed-props 'cursor-sensor-functions)
(&#22686;&#21152;&#21040;&#21015;&#34920;font-lock-extra-managed-props cursor-sensor-functions)
(advice-add 'lispy--eval <span style="font-weight: bold;">:around</span> 'scimax-spoof-mode)
(&#24314;&#35758;&#28155;&#21152;'lispy&#8212;eval:around 'scimax-spoof-mode)
(cursor-sensor-mode +1))
(cursor-sensor-mode + 1))
(remove-hook 'org-font-lock-hook #'scimax-add-keymap-to-src-blocks)
(remove-hook org-font-lock-hook # scimax-add-keymap-to-src-blocks)
(advice-remove 'lispy--eval 'scimax-spoof-mode)
(advice-remove lispy - eval scimax-spoof-mode)
(cursor-sensor-mode -1))
(cursor-sensor-mode 1))
(font-lock-fontify-buffer))
(font-lock-fontify-buffer))

(add-hook 'org-mode-hook (<span style="font-weight: bold;">lambda</span> ()
(add-hook 'org-mode-hook (<span style="font-weight: bold;">lambda</span> ()
(scimax-src-keymap-mode +1)))
(scimax-src-keymap-mode + 1)))
</pre>
</div>

<p>
That is it! I am pretty sure this is a good idea. It helps a lot when you are
这就是它!我很确定这是个好主意。这对你很有帮助
writing a lot of short code blocks and near equal amounts of text (like in
编写大量的短代码块和几乎相同数量的文本(比如in)
this blog post). It also helps write the code since many things like
这篇文章)。它也有助于写代码，因为许多事情像
indentation, parentheses, etc. are automatically handled. That is what I used
缩进、括号等自动处理。我用的就是这个
to go into special-edit mode all the time for!
要进入特殊编辑模式的所有时间!
</p>

<p>
I have not used this long enough to know if it causes any other surprises. If
我使用这个时间还不够长，不知道它是否会引起其他意外。如果
you try it and find any, leave a comment!
你可以试一试，找到任何一个，请留言!
</p>
